Repository: GNOME/libgweather
Catalog: po/*.po
Languages: ml

source: Greenwich Mean Time
ml: ഗ്രീന്‍വിച് മധ്യ സമയം

# timezone
source: Unknown
ml: അറിയാത്ത

source: Variable
ml: വേരിയബിള്‍

source: North
ml: വടക്കന്‍

source: North - NorthEast
ml: തെക്ക് - തെക്ക് കിഴക്ക്

source: Northeast
ml: തെക്ക് കിഴക്ക്

source: East - NorthEast
ml: കിഴക്ക് - തെക്ക് കിഴക്ക്

source: East
ml: കിഴക്ക്

source: East - Southeast
ml: കിഴക്ക് - വടക്ക് കിഴക്ക്

source: Southeast
ml: വടക്ക് കിഴക്കു്

source: South - Southeast
ml: വടക്ക് - വടക്ക് കിഴക്ക്

source: South
ml: വടക്ക്

source: South - Southwest
ml: വടക്ക് - വടക്ക് പടിഞ്ഞാറ്

source: Southwest
ml: വടക്ക് പടിഞ്ഞാറു്

source: West - Southwest
ml: പടിഞ്ഞാറ് - വടക്ക് പടിഞ്ഞാറു്

source: West
ml: പടിഞ്ഞാറു്

source: West - Northwest
ml: പടിഞ്ഞാറ് - വടക്കുപടിഞ്ഞാറ്

source: Northwest
ml: വടക്ക് പടിഞ്ഞാറു്

source: North - Northwest
ml: വടക്ക് - വടക്ക് കിഴക്ക്

# wind direction
source: Invalid
ml: അസാധു

source: Clear Sky
ml: തെളിഞ്ഞ ആകാശം

source: Broken clouds
ml: വിഭജിച്ച മേഘങ്ങള്‍

source: Scattered clouds
ml: അവിടിവിടം മേഘങ്ങള്‍

source: Few clouds
ml: കുറച്ചു മേഘങ്ങള്‍

source: Overcast
ml: മൂടിക്കിടക്കുന്നു

# sky conditions
source: Invalid
ml: അസാധു

source: Thunderstorm
ml: കൊടുങ്കാറ്റ്

source: Drizzle
ml: ചാറ്റല്‍

source: Light drizzle
ml: ചെറിയ ചാറ്റല്‍

source: Moderate drizzle
ml: ഇടത്തരം ചാറ്റല്‍

source: Heavy drizzle
ml: വലിയ ചാറ്റല്‍

source: Freezing drizzle
ml: തണുത്ത ചാറ്റല്‍

source: Rain
ml: മഴ

source: Light rain
ml: ചെറിയ മഴ

source: Moderate rain
ml: ഇടത്തരം മഴ

source: Heavy rain
ml: പെരുമഴ

source: Rain showers
ml: മഴ

source: Freezing rain
ml: തണുപ്പുള്ള മഴ

source: Snow
ml: മഞ്ഞു

source: Light snow
ml: ചെറിയ മഞ്ഞു

source: Moderate snow
ml: ഇടത്തരം മഞ്ഞ്

source: Heavy snow
ml: കടും മഞ്ഞു

source: Snowstorm
ml: മഞ്ഞുമഴ

source: Blowing snowfall
ml: മഞ്ഞുവീഴ്ച

source: Snow showers
ml: മഞ്ഞു മഴ

source: Drifting snow
ml: മഞ്ഞു്

source: Snow grains
ml: മഞ്ഞു് വീഴ്ച

source: Light snow grains
ml: ഇടത്തരം മഞ്ഞു് വീഴ്ച

source: Moderate snow grains
ml: ഇടത്തരം മഞ്ഞു് വീഴ്ച

source: Heavy snow grains
ml: വലിയ മഞ്ഞു് വീഴ്ച

source: Ice crystals
ml: മഞ്ഞ് പളുങ്ക്

source: Ice pellets
ml: കല്ലു മഴ

source: Few ice pellets
ml: ചെറിയ കല്ലു മഴ

source: Moderate ice pellets
ml: ഇടത്തരം കല്ലു മഴ

source: Heavy ice pellets
ml: വലിയ കല്ലുമഴ

source: Ice pellet storm
ml: കല്ലു മഴ കൊടുങ്കാറ്റ്

source: Showers of ice pellets
ml: കല്ലു മഴ

source: Hail
ml: ആലിപ്പഴം

source: Hailstorm
ml: ആലിപ്പഴം

source: Hail showers
ml: ആളിപ്പഴമുള്ള മഴ

source: Small hail
ml: ചെറിയ ആലിപ്പഴം

source: Small hailstorm
ml: ചെറിയ ആലിപ്പഴം

source: Showers of small hail
ml: ആലിപ്പഴം

source: Unknown precipitation
ml: അറിയാത്ത പ്രേസിപ്പിറ്റേഷന്‍

source: Mist
ml: മഞ്ഞ് (മിസ്റ്റ്‌)

source: Fog
ml: മഞ്ഞ് (ഫോഗ്)

source: Fog in the vicinity
ml: മൂടല്‍മഞ്ഞു്

source: Shallow fog
ml: മിതമായ മൂടല്‍മഞ്ഞു്

source: Patches of fog
ml: മൂടല്‍മഞ്ഞ്

source: Partial fog
ml: അര മഞ്ഞ്

source: Freezing fog
ml: തണുക്കുന്ന മഞ്ഞ്

source: Smoke
ml: പുക

source: Volcanic ash
ml: അഗ്നിപര്‍വത ചാരം

source: Sand
ml: മണല്‍

source: Blowing sand
ml: പൊടിക്കാറ്റ്

source: Drifting sand
ml: പൊടി

source: Haze
ml: മഞ്ഞ്

source: Blowing sprays
ml: സ്പ്രേ

source: Dust
ml: പോടി

source: Blowing dust
ml: പറക്കുന്ന പൊടി

source: Drifting dust
ml: നീങ്ങുന്ന പൊടി

source: Squall
ml: സ്ക്വാള്‍

source: Sandstorm
ml: പൊടിക്കാറ്റ്

source: Sandstorm in the vicinity
ml: പൊടിക്കാറ്റ്

source: Heavy sandstorm
ml: വലിയ പൊടിക്കാറ്റ്

source: Duststorm
ml: പൊടിക്കാറ്റ്

source: Duststorm in the vicinity
ml: പൊടിക്കാറ്റ്

source: Heavy duststorm
ml: വലിയ പൊടിക്കാറ്റ്

source: Funnel cloud
ml: ഫണല്‍ രീതിയിലുള്ള മേഘം

source: Tornado
ml: ടൊര്‍ണാഡോ

source: Dust whirls
ml: പൊടി ചുഴലി

source: Dust whirls in the vicinity
ml: പൊടു ചുഴലി

source: Unknown observation time
ml: അപരിചിതമായ ഒബ്സര്‍വേഷന്‍ സമയം

# sky conditions
source: Unknown
ml: അറിയപ്പെടാത്ത

source: %.1f °F
ml: %.1f °ഫ

source: %d °F
ml: %d °ഫ

source: %.1f °C
ml: %.1f °സെ

source: %d °C
ml: %d °സെ

source: %.1f K
ml: %.1f കെ

# temperature unit
source: Unknown
ml: അറിയപ്പെടാത്ത

# temperature
source: Unknown
ml: അറിയപ്പെടാത്ത

# dew
source: Unknown
ml: അറിയപ്പെടാത്ത

# humidity
source: Unknown
ml: അറിയപ്പെടാത്ത

source: %0.1f knots
ml: %.1f നോട്ട്സ്

source: %.1f m/s
ml: %.1f മീ/സെ

source: Beaufort force %.1f
ml: ബ്യൂഫോര്‍ട്ട് ഫോഴ്സ് %.1f

# speed unit
source: Unknown
ml: അറിയപ്പെടാത്ത

# wind speed
source: Unknown
ml: അറിയപ്പെടാത്ത

source: Calm
ml: നിശ്ചലം

# pressure
source: Unknown
ml: അറിയപ്പെടാത്ത

# pressure unit
source: Unknown
ml: അറിയപ്പെടാത്ത

# visibility
source: Unknown
ml: അറിയപ്പെടാത്ത

source: %.1f miles
ml: %.1f മൈലുകള്‍

source: %.1f km
ml: %.1f കി.മി.

# visibility unit
source: Unknown
ml: അറിയപ്പെടാത്ത

source: Retrieval failed
ml: ലഭ്യമാക്കല്‍ പരാജയപ്പെട്ടു

source: Failed to get METAR data: %d %s.
ml: METAR ഡേറ്റാ ലഭ്യമാക്കുന്നതില്‍ പരാജയപ്പെട്ടു: %d %s.

source: Weather data from the <a href="http://yr.no/">Norwegian Meteorological Institute</a>
ml: <a href="http://yr.no/">നോര്‍വീജിയന്‍ കാലാവസ്ഥ നിരീക്ഷണ കേന്ദ്രത്തില്‍</a> നിന്നുമുള്ള കാലാവസ്ഥ വിവരം

source: URL for the radar map
ml: റഡാര്‍ മാപ്പിനുള്ള യുആര്‍എല്‍

source: The custom URL from where to retrieve a radar map, or empty for disabling radar maps.
ml: ഒരു റഡാര്‍ മാപ്പ് ലഭ്യമാക്കുവാന്‍ യഥേഷ്ടമുള്ള റഡാര്‍ മാപ്പ്, അല്ലെങ്കില്‍ റഡാര്‍ മാപ്പുകള്‍ പ്രവര്‍ത്തന രഹിതമാക്കുന്നതിനുള്ള റഡാര്‍ മാപ്പുകള്‍.

source: 'fahrenheit'
ml: 'ഫാരന്‍ഹീറ്റ്'

source: Temperature unit
ml: താപനില

source: The unit of temperature used for showing weather. Valid values are 'kelvin', 'centigrade' and 'fahrenheit'.
ml: കാലാവസ്ഥ കാണിയ്ക്കുന്നതിനായി ഉപയോഗിയ്ക്കുന്ന യൂണിറ്റ്. ശരിയായ മൂല്ല്യങ്ങള്‍: 'കെല്‍വിന്‍', 'സെന്റിഗ്രേഡ്', 'ഫാരന്‍ഹീറ്റ്'

source: 'miles'
ml: 'മൈലുകള്‍'

source: Distance unit
ml: ദൂരത്തിനുള്ള യൂണിറ്റ്

source: The unit of distance used for showing weather (for example for visibility or for distance of important events). Valid values are 'meters', 'km' and 'miles'.
ml: കാലാവസ്ഥ കാണിയ്ക്കുന്നതിനുള്ള ദൂരതയ്ക്കുള്ള യൂണിറ്റ്. ശരിയായ മൂല്ല്യങ്ങള്‍ 'മീറ്ററുകള്‍', 'കിമി' 'മൈലുകള്‍'.

source: 'knots'
ml: 'നോട്ടുകള്‍'

source: Speed unit
ml: വേഗതയുടെ യൂണിറ്റ്

source: The unit of speed used for showing weather (for example for wind speed). Valid values are 'ms' (meters per second), 'kph' (kilometers per hour), 'mph' (miles per hour), 'knots' and 'bft' (Beaufort scale).
ml: കാലാവസ്ഥ കാണിയ്ക്കുന്ന വേഗതയുടെ യൂണിറ്റ്. ശരിയായ മൂല്ല്യങ്ങള്‍ 'ms', 'kph', 'mph', 'knots' , 'bft'.

source: Pressure unit
ml: പ്രഷര്‍ യൂണിറ്റ്

source: The unit of pressure used for showing weather. Valid values are 'kpa' (kilopascal), 'hpa' (hectopascal), 'mb' (millibar, mathematically equivalent to 1 hPa but shown differently), 'mm-hg' (millimiters of mercury), 'inch-hg' (inches of mercury), 'atm' (atmospheres).
ml: കാലാവസ്ഥ കാണിയ്ക്കുന്ന പ്രഷറിനുള്ള യൂണിറ്റ്. സാധുതയുള്ള മൂല്ല്യങ്ങള്‍:'kpa' (കിലോപാസ്കല്‍), 'hpa' (ഹെക്ടോപാസ്കല്‍), 'mb' (മില്ലിബാര്‍), 'mm-hg' (മെര്‍ക്കുറി മില്ലിമീറ്ററില്‍), 'inch-hg' (മെര്‍ക്കുറി ഇഞ്ചുകളില്‍), 'atm' (അറ്റ്മോസ്ഫിയര്‍).

source: Default location
ml: സ്വതവേയുള്ള സ്ഥലം

source: The default location for the weather applet. The first field is the name that will be shown. If empty, it will be taken from the locations database. The second field is the METAR code for the default weather station. It must not be empty and must correspond to a &lt;code&gt; tag in the Locations.xml file. The third field is a tuple of (latitude, longitude), to override the value taken from the database. This is only used for sunrise and moon phase calculations, not for weather forecast.
ml: കാലവസ്ഥയുടെ പ്രയോഗത്തിനു് സ്വതവേയുള്ള സ്ഥാനം. ആദ്യത്തെ ഫീള്‍ഡ് പേരാണു്. കാലിയാണെങ്കില്‍, സ്ഥാനങ്ങളുടെ ഡേറ്റാബെയിസില്‍ നിന്നും എടുക്കുന്നു. രണ്ടാമത്തെ ഫീള്‍ഡില്‍ സ്വതവേയുള്ള കാലാവസ്ഥ കേന്ദ്രത്തിന്റെ METAR കോഡാകുന്നു. ഇതു് കാലിയാകുവാന്‍ പാടില്ല. Locations.xml ഫയലിലുള്ള &lt;code&gt; റ്റാഗനുസരിച്ചാകുന്നു. മൂന്നാമത്തെ ഫീള്‍ഡ്, (ലാറ്റിറ്റ്യൂഡ്, ലോങ്റ്റിറ്റ്യൂഡ്) എന്നാകുന്നു. ഡേറ്റാബെയിസില്‍ നിന്നുള്ള മൂല്ല്യം ഇതു് തിരുത്തുന്നു. ഇതു് സൂര്യോദയം, ചന്ദ്രനെ സംബന്ധിച്ചുള്ള കണക്കുകൂട്ടലുകള്‍ എന്നിവയ്ക്കുപയോഗിയ്ക്കുന്നു.
